BusinessProcesses/ПоставкаТовараВАптечныйПункт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<BusinessProcess>
		<Properties>
			<Name>ПоставкаТовараВАптечныйПункт</Name>
			<Task>Task.ЗадачиПоставкиВАптечныеПункты</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АптечныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокОтделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеТовараНаСкладе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаличиеТовараНаСкладе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсуществляетПоставку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаДокументаПоставки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоставкаВПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/СостояниеПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СостояниеПоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦелая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеполнаяПоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БракованнаяПоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаНеОсущствлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварДоставляется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/ПоставкаТовараВАптечныйПункт/Forms/ФормаБизнесПроцесса/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьКартуМаршрута()	
	БизнесПроцессОбъект = РеквизитФормыВЗначение("Объект");
	КартаМаршрута=БизнесПроцессОбъект.ПолучитьКартуМаршрута();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	 ОбновитьКартуМаршрута();
	 // или можно:
	 //КартаМаршрута=ТекущийОбъект.ПолучитьКартуМаршрута();	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	 ОбновитьКартуМаршрута();
КонецПроцедуры


&НаСервере
Процедура ИзмененияСоставаПосавки(ЭлементСостоянияПоставки, ЭлементТаблицыТоваров)
	
КонецПроцедуры


&НаСервере
Функция проверитьНеобходимостьИзмененияСоставаПоставки(СостояниеПоставки)
	Если Объект.СостояниеПоставки=Перечисления.СостояниеПоставки.БракованнаяПоставка ИЛИ
	Объект.СостояниеПоставки=Перечисления.СостояниеПоставки.НеполнаяПоставка Тогда
		 Возврат Истина;
	Иначе
		 Возврат Ложь;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура СостояниеПоставкиПриИзменении(Элемент)
	Если проверитьНеобходимостьИзмененияСоставаПоставки(Объект.СостояниеПоставки)= Истина Тогда
		Сообщить("Измените состав поставки");
		Элементы.Товары.ТолькоПросмотр=Ложь;
	Иначе
		 Элементы.Товары.ТолькоПросмотр=Истина;
	КонецЕсли;
	//ИзмененияСоставаПосавки(Элементы.СостояниеПоставки, Элементы.Товары);
КонецПроцедуры
